marekvi95/smartlock-fw/board/pin_mux.c
    /* PORTB2 (pin 37) is configured as TPM2_CH0 */
    PORT_SetPinMux(PORTB, 2U, kPORT_MuxAlt3);

    /* PORTC1 (pin 44) is configured as I2C1_SCL */
    PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt2);

    /* PORTC2 (pin 45) is configured as I2C1_SDA */
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt2);

    /* PORTC20 (pin 49) is configured as PTC20 */
    PORT_SetPinMux(BOARD_INITPINS_DP_DC_PORT, BOARD_INITPINS_DP_DC_PIN, kPORT_MuxAsGpio);

    /* PORTC21 (pin 50) is configured as PTC21 */
    PORT_SetPinMux(BOARD_INITPINS_DP_BUSY_PORT, BOARD_INITPINS_DP_BUSY_PIN, kPORT_MuxAsGpio);

    /* PORTC22 (pin 51) is configured as PTC22 */
    PORT_SetPinMux(BOARD_INITPINS_DP_RST_PORT, BOARD_INITPINS_DP_RST_PIN, kPORT_MuxAsGpio);

    /* PORTC23 (pin 52) is configured as PTC23 */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_AK_PORT, BOARD_INITPINS_SIGFOX_AK_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[23] = ((PORTC->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTC3 (pin 46) is configured as LLWU_P7, PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_BATT_C_PORT, BOARD_INITPINS_BATT_C_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 53) is configured as LLWU_P8, PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_POWER_STAT_PORT, BOARD_INITPINS_POWER_STAT_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 54) is configured as LLWU_P9 */
    PORT_SetPinMux(BOARD_INITPINS_INT1_ACCEL_PORT, BOARD_INITPINS_INT1_ACCEL_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 55) is configured as LLWU_P10 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_P26_PORT, BOARD_INITPINS_LCD_P26_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 57) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_CS_PORT, BOARD_INITPINS_SIGFOX_CS_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 58) is configured as SPI0_SCK */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_SCK_PORT, BOARD_INITPINS_SIGFOX_SCK_PIN, kPORT_MuxAlt2);

    /* PORTD2 (pin 59) is configured as SPI0_MOSI */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_SDO_PORT, BOARD_INITPINS_SIGFOX_SDO_PIN, kPORT_MuxAlt2);

    /* PORTD3 (pin 60) is configured as SPI0_MISO */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_SDI_PORT, BOARD_INITPINS_SIGFOX_SDI_PIN, kPORT_MuxAlt2);

    /* PORTD4 (pin 61) is configured as SPI1_SS */
    PORT_SetPinMux(BOARD_INITPINS_DP_CS_PORT, BOARD_INITPINS_DP_CS_PIN, kPORT_MuxAlt2);

    /* PORTD5 (pin 62) is configured as SPI1_SCK */
    PORT_SetPinMux(BOARD_INITPINS_DP_SCK_PORT, BOARD_INITPINS_DP_SCK_PIN, kPORT_MuxAlt2);

    /* PORTD6 (pin 63) is configured as SPI1_MOSI */
    PORT_SetPinMux(BOARD_INITPINS_DP_DIN_PORT, BOARD_INITPINS_DP_DIN_PIN, kPORT_MuxAlt2);

    /* PORTD7 (pin 64) is configured as SPI1_MISO */
    PORT_SetPinMux(PORTD, 7U, kPORT_MuxAlt2);

    /* PORTE0 (pin 1) is configured as PTE0 */
    PORT_SetPinMux(BOARD_INITPINS_NFC_RST_PORT, BOARD_INITPINS_NFC_RST_PIN, kPORT_MuxAsGpio);

    /* PORTE1 (pin 2) is configured as PTE1 */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_RST_PORT, BOARD_INITPINS_SIGFOX_RST_PIN, kPORT_MuxAsGpio);

    /* PORTE24 (pin 20) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_I2C0_SCL_PORT, BOARD_INITPINS_I2C0_SCL_PIN, kPORT_MuxAlt5);

    /* PORTE25 (pin 21) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_I2C0_SDA_PORT, BOARD_INITPINS_I2C0_SDA_PIN, kPORT_MuxAlt5);

    /* PORTE30 (pin 18) is configured as PTE30 */
    PORT_SetPinMux(PORTE, 30U, kPORT_MuxAsGpio);

    /* PORTE31 (pin 19) is configured as TPM0_CH4 */
    PORT_SetPinMux(BOARD_INITPINS_LED2_PORT, BOARD_INITPINS_LED2_PIN, kPORT_MuxAlt3);

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_TPM1CH0SRC_MASK | SIM_SOPT4_TPM2CH0SRC_MASK)))

                  /* TPM1 channel 0 input capture source select: TPM1_CH0 signal. */
                  | SIM_SOPT4_TPM1CH0SRC(SOPT4_TPM1CH0SRC_TPM1_CH0)

                  /* TPM2 Channel 0 Input Capture Source Select: TPM2_CH0 signal. */
                  | SIM_SOPT4_TPM2CH0SRC(SOPT4_TPM2CH0SRC_TPM2_CH0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLCDPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '41', peripheral: LCD, signal: 'P, 14', pin_signal: LCD_P14/PTB18/TPM2_CH0, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '42', peripheral: LCD, signal: 'P, 15', pin_signal: LCD_P15/PTB19/TPM2_CH1, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '43', peripheral: LCD, signal: 'P, 20', pin_signal: LCD_P20/ADC0_SE14/PTC0/EXTRG_IN/USB_SOF_OUT/CMP0_OUT, identifier: LCD_P20, slew_rate: slow, pull_select: up,
    pull_enable: disable}
  - {pin_num: '53', peripheral: LCD, signal: 'P, 24', pin_signal: LCD_P24/PTC4/LLWU_P8/SPI0_SS/LPUART1_TX/TPM0_CH3, identifier: LCD_P24, slew_rate: slow, pull_select: up,
    pull_enable: disable}
  - {pin_num: '55', peripheral: LCD, signal: 'P, 26', pin_signal: LCD_P26/CMP0_IN0/PTC6/LLWU_P10/SPI0_MOSI/EXTRG_IN/SPI0_MISO, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '56', peripheral: LCD, signal: 'P, 27', pin_signal: LCD_P27/CMP0_IN1/PTC7/SPI0_MISO/USB_SOF_OUT/SPI0_MOSI, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '57', peripheral: LCD, signal: 'P, 40', pin_signal: LCD_P40/PTD0/SPI0_SS/TPM0_CH0/FXIO0_D0, identifier: LCD_P40, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '59', peripheral: LCD, signal: 'P, 42', pin_signal: LCD_P42/PTD2/SPI0_MOSI/UART2_RX/TPM0_CH2/SPI0_MISO/FXIO0_D2, identifier: LCD_P42, slew_rate: slow,
    pull_select: up, pull_enable: disable}
  - {pin_num: '60', peripheral: LCD, signal: 'P, 43', pin_signal: LCD_P43/PTD3/SPI0_MISO/UART2_TX/TPM0_CH3/SPI0_MOSI/FXIO0_D3, identifier: LCD_P43, slew_rate: slow,
    pull_select: up, pull_enable: disable}
  - {pin_num: '61', peripheral: LCD, signal: 'P, 44', pin_signal: LCD_P44/PTD4/LLWU_P14/SPI1_SS/UART2_RX/TPM0_CH4/FXIO0_D4, identifier: LCD_P44, slew_rate: slow,
    pull_select: up, pull_enable: disable}
  - {pin_num: '9', peripheral: LCD, signal: 'P, 59', pin_signal: LCD_P59/ADC0_DP0/ADC0_SE0/PTE20/TPM1_CH0/LPUART0_TX/FXIO0_D4, slew_rate: slow, pull_select: up, pull_enable: disable}
  - {pin_num: '10', peripheral: LCD, signal: 'P, 60', pin_signal: LCD_P60/ADC0_DM0/ADC0_SE4a/PTE21/TPM1_CH1/LPUART0_RX/FXIO0_D5, slew_rate: slow, pull_select: up,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

